DELETE FROM user_roles;
DELETE FROM users;
DELETE FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id) VALUES
  ('2020-01-29 11:00', 'Предыдущий день', 2100, 100000),
  ('2020-01-30 10:00', 'Завтрак', 500, 100000),
  ('2020-01-30 13:00', 'Обед', 1000, 100000),
  ('2020-01-30 20:00', 'Ужин', 500, 100000),
  ('2020-01-31 00:00', 'Еда на граничное значение', 100, 100000),
  ('2020-01-31 10:00', 'Завтрак', 1000, 100000),
  ('2020-01-31 13:00', 'Обед', 500, 100000),
  ('2020-01-31 20:00', 'Ужин', 410, 100000),
  ('2020-02-01 20:00', 'Следующий день', 699, 100000),
  ('2020-01-25 9:35', 'Плотный завтрак', 900, 100001),
  ('2020-01-25 10:00', 'Перекус', 120, 100001),
  ('2020-01-24 13:30', 'Обед', 600, 100001),
  ('2020-01-23 19:00', 'Ужин в ресторане', 1200, 100001);

